cdr-15.org
#+title: Package-Local Nicknames
#+author: Gleefre
#+email: varedif.a.s@gmail.com

#+description: This is a CDR specification for package-local nicknames.
#+language: en
#+created: [2023-06-12 Mon]

[THIS IS A DRAFT]

* ISSUES
  :PROPERTIES:
  :CUSTOM_ID: issues
  :END:
** Issue 1.
   Inconsistency between return values of ~add-package-local-nickname~ and
   ~remove-package-local-nickname~. First always returns /designated package/,
   second one returns /true/ if a nickname was removed (but it is not specified
   what exactly is returned). (Somewhat similar functions from the standard -
   ~use-package~ and ~unuse-package~ always return ~T~ - their api is
   consistent.)
*** Proposal
    - ~add-package-local-nickname~ should return /designated package/ if a new
      nickname was added and ~NIL~ otherwise (if it already existed).
    - ~remove-package-local-nickname~ should return /designated package/ if
      nickname was removed and ~NIL~ otherwise.
*** Currently
   sbcl, ccl, ecl, acl, abcl, clasp: ~add-package-local-nickname~ always returns
   /designated package/.

   sbcl, ccl, ecl, acl, clasp: ~remove-package-local-nickname~ returns ~T~ on
   success and ~NIL~

   abcl: ~remove-package-local-nickname~ returns package nicknamed by the
   removed nickname on success and ~NIL~.  [ That seems nice ]
** Issue 2
   See [[#print-read-consistency][PRINT-READ consistency]].
*** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:export #:+))
    (defpackage #:b (:local-nicknames (#:a #:cl)))
    (let ((*package* (find-package '#:b)))
      (print 'a:+))
    ; => a:+ everywhere
    ;; but in #:b package a:+ would refer to cl:+
    #+END_SRC
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:export #:+))
    (defpackage #:b (:use) (:export #:+))
    (defpackage #:c (:use) (:local-nicknames (#:a #:b) (#:b #:a)))
    (let ((*package* (find-package '#:c)))
      (print 'a:+))
    ; => b:+  (sbcl, ccl, abcl)
    ; => a:+  (clasp, acl, ecl)
    ;; but in #:c package a:+ would refer to b:+
    #+END_SRC
*** Currently
     sbcl, ccl, abcl: print symbol with package name when all package's names
     and nicknames are shadowed by /current package/'s /local nicknames/.

     ecl, acl, clasp: don't print with local nicknames at all.
** Issue 3
   It is not clear whether /local nicknames/ of the /current package/ should
   affect ~make-package~ or ~defpackage~.
*** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:export #:x))
    (defpackage #:b (:use) (:export #:x))
    (defpackage #:c
      (:use #:cl)
      (:local-nicknames (#:a #:b) (#:b #:a)))

    (in-package #:c)
    (defpackage #:d
      (:use #:a)
      (:export #:x))
    (print (package-name (symbol-package 'd:x)))
    ; => "B"  (sbcl, ccl, acl, abcl)
    ; => "A"  (ecl, clasp)

    (defpackage #:e
      (:use)
      (:local-nicknames (#:x #:a)))

    (let ((*package* (find-package '#:e)))
      (print (package-name (find-package '#:x))))
    ; => "B"  (ccl, acl, abcl)
    ; => "A" (sbcl, ecl, clasp)
    #+END_SRC
*** Proposal
    They should not.  [ or they should? ]
*** Currently
    ccl, acl, abcl: they do.

    sbcl: partly (:use is affected, :local-nicknames are not)

    ecl, clasp: they don't.
** Issue 4
   It is not clear whether /local nicknames/ of the package *being defined*
   should affect ~make-package~ or ~defpackage~.
*** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:export #:x))
    (defpackage #:b (:use) (:export #:x))
    (defpackage #:c
      (:use #:a)
      (:local-nicknames (#:a #:b) (#:b #:a)))

    (print (package-name (symbol-package 'c::x)))
    ; => "A"  (sbcl, ccl, acl, abcl, clasp)
    ;; ecl errors... :/
    #+END_SRC
*** Proposal
    They should not.
