cdr-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-16 Fri 00:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Package-Local Nicknames</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gleefre" />
<meta name="description" content="This is a CDR specification for package-local nicknames."
 />
</head>
<body>
<div id="content">
<h1 class="title">Package-Local Nicknames</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#issues">1. ISSUES</a>
<ul>
<li><a href="#org91629c7">1.1. Issue 1.</a>
<ul>
<li><a href="#org3803ce2">1.1.1. Proposal</a></li>
<li><a href="#org7881d6e">1.1.2. Currently</a></li>
</ul>
</li>
<li><a href="#org206bbf7">1.2. Issue 2</a>
<ul>
<li><a href="#org5ad59e1">1.2.1. Example</a></li>
<li><a href="#org6705229">1.2.2. Currently</a></li>
</ul>
</li>
<li><a href="#org64a1711">1.3. Issue 3</a>
<ul>
<li><a href="#org2e6f2b1">1.3.1. Example</a></li>
<li><a href="#orgdd0dc6c">1.3.2. Proposal</a></li>
<li><a href="#org3aabf3a">1.3.3. Currently</a></li>
</ul>
</li>
<li><a href="#org68bbeb1">1.4. Issue 4</a>
<ul>
<li><a href="#orgfa0a80f">1.4.1. Example</a></li>
<li><a href="#orga66e9c1">1.4.2. Proposal</a></li>
<li><a href="#orgbea3326">1.4.3. Currently</a></li>
</ul>
</li>
<li><a href="#org0cdcd7a">1.5. Issue 5</a>
<ul>
<li><a href="#orge3a446d">1.5.1. Example</a></li>
<li><a href="#org630c1fa">1.5.2. Proposal</a></li>
<li><a href="#org735d2d1">1.5.3. Currently</a></li>
</ul>
</li>
<li><a href="#proposal-6">1.6. Proposal 6</a>
<ul>
<li><a href="#org7aff6d3">1.6.1. Currently</a></li>
</ul>
</li>
<li><a href="#org900e49c">1.7. Issue 7</a>
<ul>
<li><a href="#orgdf923f3">1.7.1. Example</a></li>
<li><a href="#orgad1785a">1.7.2. Proposal</a></li>
<li><a href="#org943e42d">1.7.3. Currently</a></li>
</ul>
</li>
<li><a href="#org43a1f96">1.8. Issue 8 <i>by |3b|</i></a></li>
</ul>
</li>
<li><a href="#orgac72010">2. Introduction</a>
<ul>
<li><a href="#orgbc97ea7">2.1. Rationale</a></li>
<li><a href="#orgcdae189">2.2. Current state</a></li>
<li><a href="#orgf8cef33">2.3. Goal</a></li>
</ul>
</li>
<li><a href="#org804a50f">3. Specification</a>
<ul>
<li><a href="#org6999964">3.1. Description</a>
<ul>
<li><a href="#orgbd0de20">3.1.1. Concept</a></li>
<li><a href="#org603cdeb">3.1.2. API</a></li>
<li><a href="#orgea54de3">3.1.3. Affected symbols</a></li>
<li><a href="#orgb6128c8">3.1.4. Edge cases</a></li>
<li><a href="#orgb30f773">3.1.5. <code>*FEATURES*</code></a></li>
</ul>
</li>
<li><a href="#org73e7fdc">3.2. Examples</a></li>
</ul>
</li>
<li><a href="#org6d3f16b">4. Links</a></li>
<li><a href="#org6d31638">5. Copying and License</a></li>
</ul>
</div>
</div>
<p>
[THIS IS A DRAFT]
</p>

<div id="outline-container-org2e1f0e7" class="outline-2">
<h2 id="issues"><span class="section-number-2">1</span> ISSUES</h2>
<div class="outline-text-2" id="text-issues">
</div>
<div id="outline-container-org91629c7" class="outline-3">
<h3 id="org91629c7"><span class="section-number-3">1.1</span> Issue 1.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Inconsistency between return values of <code>add-package-local-nickname</code> and
<code>remove-package-local-nickname</code>. First always returns <i>designated package</i>,
second one returns <i>true</i> if a nickname was removed (but it is not specified
what exactly is returned). (Somewhat similar functions from the standard -
<code>use-package</code> and <code>unuse-package</code> always return <code>T</code> - their api is
consistent.)
</p>
</div>
<div id="outline-container-org3803ce2" class="outline-4">
<h4 id="org3803ce2"><span class="section-number-4">1.1.1</span> Proposal</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><code>add-package-local-nickname</code> should return <i>designated package</i> if a new
nickname was added and <code>NIL</code> otherwise (if it already existed).</li>
<li><code>remove-package-local-nickname</code> should return <i>designated package</i> if
nickname was removed and <code>NIL</code> otherwise.</li>
</ul>
</div>
</div>
<div id="outline-container-org7881d6e" class="outline-4">
<h4 id="org7881d6e"><span class="section-number-4">1.1.2</span> Currently</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
sbcl, ccl, ecl, acl, abcl, clasp: <code>add-package-local-nickname</code> always returns
<i>designated package</i>.
</p>

<p>
sbcl, ccl, ecl, acl, clasp: <code>remove-package-local-nickname</code> returns <code>T</code> on
success and <code>NIL</code>
</p>

<p>
abcl: <code>remove-package-local-nickname</code> returns package nicknamed by the
removed nickname on success and <code>NIL</code>.  [ That seems nice ]
</p>
</div>
</div>
</div>
<div id="outline-container-org206bbf7" class="outline-3">
<h3 id="org206bbf7"><span class="section-number-3">1.2</span> Issue 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
See <a href="#print-read-consistency">PRINT-READ consistency</a>.
</p>
</div>
<div id="outline-container-org5ad59e1" class="outline-4">
<h4 id="org5ad59e1"><span class="section-number-4">1.2.1</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:+))
(defpackage #:b (:local-nicknames (#:a #:cl)))
(let ((*package* (find-package '#:b)))
  (print 'a:+))
; =&gt; a:+ everywhere
;; but in #:b package a:+ would refer to cl:+
</pre>
</div>
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:+))
(defpackage #:b (:use) (:export #:+))
(defpackage #:c (:use) (:local-nicknames (#:a #:b) (#:b #:a)))
(let ((*package* (find-package '#:c)))
  (print 'a:+))
; =&gt; b:+  (sbcl, ccl, abcl)
; =&gt; a:+  (clasp, acl, ecl)
;; but in #:c package a:+ would refer to b:+
</pre>
</div>
</div>
</div>
<div id="outline-container-org6705229" class="outline-4">
<h4 id="org6705229"><span class="section-number-4">1.2.2</span> Currently</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
sbcl, ccl, abcl: print symbol with package name when all package's names
and nicknames are shadowed by <i>current package</i>'s <i>local nicknames</i>.
</p>

<p>
ecl, acl, clasp: don't print with local nicknames at all.
</p>
</div>
</div>
</div>
<div id="outline-container-org64a1711" class="outline-3">
<h3 id="org64a1711"><span class="section-number-3">1.3</span> Issue 3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
It is not clear whether <i>local nicknames</i> of the <i>current package</i> should
affect <code>make-package</code> or <code>defpackage</code>.
</p>
</div>
<div id="outline-container-org2e6f2b1" class="outline-4">
<h4 id="org2e6f2b1"><span class="section-number-4">1.3.1</span> Example</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:x))
(defpackage #:b (:use) (:export #:x))
(defpackage #:c
  (:use #:cl)
  (:local-nicknames (#:a #:b) (#:b #:a)))

(in-package #:c)
(defpackage #:d
  (:use #:a)
  (:export #:x))
(print (package-name (symbol-package 'd:x)))
; =&gt; "B"  (sbcl, ccl, acl, abcl)
; =&gt; "A"  (ecl, clasp)

(defpackage #:e
  (:use)
  (:local-nicknames (#:x #:a)))

(let ((*package* (find-package '#:e)))
  (print (package-name (find-package '#:x))))
; =&gt; "B"  (ccl, acl, abcl)
; =&gt; "A" (sbcl, ecl, clasp)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd0dc6c" class="outline-4">
<h4 id="orgdd0dc6c"><span class="section-number-4">1.3.2</span> Proposal</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
They should affect all options like <code>:use</code>, <code>:local-nicknames</code>,
<code>:shadowing-import-from</code> and <code>:import-from</code>.
</p>
</div>
</div>
<div id="outline-container-org3aabf3a" class="outline-4">
<h4 id="org3aabf3a"><span class="section-number-4">1.3.3</span> Currently</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
ccl, acl, abcl: they do.
</p>

<p>
sbcl: partly (:use is affected, :local-nicknames are not)
</p>

<p>
ecl, clasp: they don't.
</p>
</div>
</div>
</div>
<div id="outline-container-org68bbeb1" class="outline-3">
<h3 id="org68bbeb1"><span class="section-number-3">1.4</span> Issue 4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
It is not clear whether <i>local nicknames</i> of the package <b>being defined</b>
should affect <code>make-package</code> or <code>defpackage</code>.
</p>
</div>
<div id="outline-container-orgfa0a80f" class="outline-4">
<h4 id="orgfa0a80f"><span class="section-number-4">1.4.1</span> Example</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:x))
(defpackage #:b (:use) (:export #:x))
(defpackage #:c
  (:use #:a)
  (:local-nicknames (#:a #:b) (#:b #:a)))

(print (package-name (symbol-package 'c::x)))
; =&gt; "A"  (sbcl, ccl, acl, abcl, clasp)
;; ecl errors... :/
</pre>
</div>
</div>
</div>
