cdr-15.tex
% Created 2023-06-15 Thu 11:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gleefre}
\date{\today}
\title{Package-Local Nicknames}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={Package-Local Nicknames},
 pdfkeywords={},
 pdfsubject={This is a CDR specification for package-local nicknames.},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

[THIS IS A DRAFT]

\section{ISSUES}
\label{sec:orgeeb4508}
\begin{enumerate}
\item Inconsistency between return values of \texttt{add-package-local-nickname} and
\texttt{remove-package-local-nickname}. First always returns \emph{designated package},
second one returns \emph{true} if a nickname was removed (but it is not
specified what exactly is returned). (Somewhat similar functions from the
standard - \texttt{use-package} and \texttt{unuse-package} always return \texttt{T} - their api
is consistent.)

\textbf{PROPOSAL}:
\begin{itemize}
\item \texttt{add-package-local-nickname} should return \emph{designated package} if a new
nickname was added and \texttt{NIL} otherwise (if it already existed).
\item \texttt{remove-package-local-nickname} should return \emph{designated package} if
nickname was removed and \texttt{NIL} otherwise.
\end{itemize}

\textbf{CURRENTLY}:

sbcl, ccl, ecl, acl, abcl, clasp: \texttt{add-package-local-nickname} always returns
\emph{designated package}.

sbcl, ccl, ecl, acl, clasp: \texttt{remove-package-local-nickname} returns \texttt{T} on success
and \texttt{NIL}

abcl: \texttt{remove-package-local-nickname} returns package nicknamed by the
removed nickname on success and \texttt{NIL}.  [ That seems nice ]
\item See \hyperref[sec:org1748ec5]{PRINT-READ consistency}.

\textbf{CURRENTLY}:

sbcl, ccl, abcl: print symbol with package name when all package's names
and nicknames are shadowed by \emph{current package}'s \emph{local nicknames}.

ecl, acl, clasp: don't print with local nicknames at all.
\item It is not clear whether \emph{local nicknames} of the \emph{current package} should
affect \texttt{make-package} or \texttt{defpackage}.

\textbf{PROPOSAL}:
They should not.  [ or they should? ]

\textbf{CURRENTLY}:

ccl, acl, abcl: they do.

sbcl: partly (:use is affected, :local-nicknames are not)

ecl, clasp: they don't.

\item It is not clear whether \emph{local nicknames} of the package \textbf{being defined}
should affect \texttt{make-package} or \texttt{defpackage}.

\textbf{PROPOSAL}:
They should not.

\textbf{CURRENTLY}:
