cdr-15.org
*** Currently
    sbcl, ccl, acl, abcl: they don't.

    ecl: they do (or not? not sure).

    clasp: they do in some weird way - also depends on order in which PLN are
    added.
** Issue 5
   It is not clear whether it is valid to have a /local nickname/ in a package
   shadowing its own name or nickname.

   Now: SBCL signals an error, but that doesn't make much sense, especially if a
   /local nickname/ shadows the /global nickname/ of a package and not its
   name. And it is possible to achieve a /local nickname/ shadowing a /global
   nickname/ or the /package name/ by renaming the package.
*** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:local-nicknames (#:a #:cl)))
    ; => error  (sbcl, ccl, abcl)
    ; => ok  (ecl, acl, clasp)
    #+END_SRC
*** Proposal
    It should be allowed, but a warning might be signaled.
*** Currently
    sbcl, ccl, abcl: not allowed.

    ecl, acl, clasp: allowed.
** Proposal 6
   Add ~:local-nicknames~ option to ~make-package~ similar to ~defpackage~. See
   [[#make-package][make-package]].
*** Currently
    ecl: takes keyword parameter, but segfaults on incorrect usage + doesn't
    have it in docstring. :/

    acl: has it

    abcl, sbcl, ccl, clasp: don't have it.
** Issue 7
   It is not clear whether functions ~package-local-nicknames~ and
   ~package-locally-nicknamed-by-list~ should be allowed to return lists with
   duplicate entries.
*** Example
    #+BEGIN_SRC common-lisp
    (defpackage #:a (:use) (:local-nicknames (#:b #:cl) (#:c #:cl)))
    (print (mapcar #'package-name (package-locally-nicknamed-by-list '#:cl)))
    ; => ("A")  (sbcl, acl, clasp)
    ; => ("A" "A")  (ccl, ecl, abcl)
    #+END_SRC
*** Proposal
    They should not.
*** Currently
    sbcl, acl, clasp, ccl, abcl, ecl: don't return duplicate entries from ~package-local-nicknames~.

    sbcl, acl, clasp: don't return duplicate entries from ~package-locally-nicknamed-by-list~.

    ccl, abcl, ecl: return duplicate entries from ~package-locally-nicknamed-by-list~.
** Issue 8 /by |3b|/
   How PLN affect ~format~'s ~\~//~ directive? It seems tricky - compilers might
   want optimize it at compile time, but reffered symbol might change on
   rebinding the ~*package*~.
* Introduction
  This is a specification for package-local nicknames extension in Common Lisp.
** Rationale
   Package-local nicknames allow to use short and easy-to-use names without
   potentially introducing name conflict as with normal nicknames.
** Current state
   Package-local nicknames are implemented (at least partially) in =SBCL=,
   =CCL=, =ECL=, =Clasp=, =ABCL=, =Allegro CL=, =LispWorks=. Unfortunately,
   there are multiple inconsistencies between implementations, and all
   implementations lose *print-read* consistency to some extent.
** Goal
   The purpose of this document is to standardize the package-local nicknames
   extension and to address some existing issues (mostly *print-read*
   consistency).

   [TODO]

   This CDR also aims to provide an extensive test suite for this extension.
* Specification
** Description
*** Concept
    /Package-local nickname/ (or /local nickname/) has the same effects as a
    normal /package nickname/ (later /global nickname/), except that these
    effects only apply when ~*package*~ is bound to a package for which the
    nickname has been defined.

    That means that calls to ~find-package~ with a /local nickname/ defined in
    the /current package/ should return the package nicknamed by this nickname.

    This also affects all implied calls to ~find-package~, including those
    performed by the lisp reader.

    In addition, to maintain *print-read* consistency, the lisp printer is
    affected by /local nicknames/ defined in the /current package/, for details
    see [[#print-read-consistency][PRINT-READ consistency]].

    /Local nickname/ is allowed to shadow a /package name/ or a /global
    nickname/, except for the names ~#:CL~, ~#:COMMON-LISP~ and ~#:KEYWORD~
    which should always refer to their packages.
*** API
-----
