cdr-15.html
<div id="outline-container-orga66e9c1" class="outline-4">
<h4 id="orga66e9c1"><span class="section-number-4">1.4.2</span> Proposal</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
They should not.
</p>
</div>
</div>
<div id="outline-container-orgbea3326" class="outline-4">
<h4 id="orgbea3326"><span class="section-number-4">1.4.3</span> Currently</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
sbcl, ccl, acl, abcl: they don't.
</p>

<p>
ecl: they do (or not? not sure).
</p>

<p>
clasp: they do in some weird way - also depends on order in which PLN are
added.
</p>
</div>
</div>
</div>
<div id="outline-container-org0cdcd7a" class="outline-3">
<h3 id="org0cdcd7a"><span class="section-number-3">1.5</span> Issue 5</h3>
<div class="outline-text-3" id="text-1-5">
<p>
It is not clear whether it is valid to have a <i>local nickname</i> in a package
shadowing its own name or nickname.
</p>

<p>
Now: SBCL signals an error, but that doesn't make much sense, especially if a
<i>local nickname</i> shadows the <i>global nickname</i> of a package and not its
name. And it is possible to achieve a <i>local nickname</i> shadowing a <i>global
nickname</i> or the <i>package name</i> by renaming the package.
</p>
</div>
<div id="outline-container-orge3a446d" class="outline-4">
<h4 id="orge3a446d"><span class="section-number-4">1.5.1</span> Example</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:local-nicknames (#:a #:cl)))
; =&gt; error  (sbcl, ccl, abcl)
; =&gt; ok  (ecl, acl, clasp)
</pre>
</div>
</div>
</div>
<div id="outline-container-org630c1fa" class="outline-4">
<h4 id="org630c1fa"><span class="section-number-4">1.5.2</span> Proposal</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
It should be allowed, but a warning might be signaled.
</p>
</div>
</div>
<div id="outline-container-org735d2d1" class="outline-4">
<h4 id="org735d2d1"><span class="section-number-4">1.5.3</span> Currently</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
sbcl, ccl, abcl: not allowed.
</p>

<p>
ecl, acl, clasp: allowed.
</p>
</div>
</div>
</div>
<div id="outline-container-org3e2f3b7" class="outline-3">
<h3 id="proposal-6"><span class="section-number-3">1.6</span> Proposal 6</h3>
<div class="outline-text-3" id="text-proposal-6">
<p>
Add <code>:local-nicknames</code> option to <code>make-package</code> similar to <code>defpackage</code>. See
<a href="#make-package">make-package</a>.
</p>
</div>
<div id="outline-container-org7aff6d3" class="outline-4">
<h4 id="org7aff6d3"><span class="section-number-4">1.6.1</span> Currently</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
ecl: takes keyword parameter, but segfaults on incorrect usage + doesn't
have it in docstring. Also API differs :/
</p>

<p>
acl: has it
</p>

<p>
abcl, sbcl, ccl, clasp: don't have it.
</p>
</div>
</div>
</div>
<div id="outline-container-org900e49c" class="outline-3">
<h3 id="org900e49c"><span class="section-number-3">1.7</span> Issue 7</h3>
<div class="outline-text-3" id="text-1-7">
<p>
It is not clear whether functions <code>package-local-nicknames</code> and
<code>package-locally-nicknamed-by-list</code> should be allowed to return lists with
duplicate entries.
</p>
</div>
<div id="outline-container-orgdf923f3" class="outline-4">
<h4 id="orgdf923f3"><span class="section-number-4">1.7.1</span> Example</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:local-nicknames (#:b #:cl) (#:c #:cl)))
(print (mapcar #'package-name (package-locally-nicknamed-by-list '#:cl)))
; =&gt; ("A")  (sbcl, acl, clasp)
; =&gt; ("A" "A")  (ccl, ecl, abcl)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad1785a" class="outline-4">
<h4 id="orgad1785a"><span class="section-number-4">1.7.2</span> Proposal</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
They should not.
</p>
</div>
</div>
<div id="outline-container-org943e42d" class="outline-4">
<h4 id="org943e42d"><span class="section-number-4">1.7.3</span> Currently</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
sbcl, acl, clasp, ccl, abcl, ecl: don't return duplicate entries from <code>package-local-nicknames</code>.
</p>

<p>
sbcl, acl, clasp: don't return duplicate entries from <code>package-locally-nicknamed-by-list</code>.
</p>

<p>
ccl, abcl, ecl: return duplicate entries from <code>package-locally-nicknamed-by-list</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org43a1f96" class="outline-3">
<h3 id="org43a1f96"><span class="section-number-3">1.8</span> Issue 8 <i>by |3b|</i></h3>
<div class="outline-text-3" id="text-1-8">
<p>
How PLN affect <code>format</code>'s <code>\~//</code> directive? It seems tricky - compilers might
want optimize it at compile time, but reffered symbol might change on
rebinding the <code>*package*</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgac72010" class="outline-2">
<h2 id="orgac72010"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
This is a specification for package-local nicknames extension in Common Lisp.
</p>
</div>
<div id="outline-container-orgbc97ea7" class="outline-3">
<h3 id="orgbc97ea7"><span class="section-number-3">2.1</span> Rationale</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Package-local nicknames allow to use short and easy-to-use names without
potentially introducing name conflict as with normal nicknames.
</p>
</div>
</div>
<div id="outline-container-orgcdae189" class="outline-3">
<h3 id="orgcdae189"><span class="section-number-3">2.2</span> Current state</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Package-local nicknames are implemented (at least partially) in <code>SBCL</code>,
<code>CCL</code>, <code>ECL</code>, <code>Clasp</code>, <code>ABCL</code>, <code>Allegro CL</code>, <code>LispWorks</code>. Unfortunately,
there are multiple inconsistencies between implementations, and all
implementations lose <b>print-read</b> consistency to some extent.
</p>
</div>
</div>
<div id="outline-container-orgf8cef33" class="outline-3">
<h3 id="orgf8cef33"><span class="section-number-3">2.3</span> Goal</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The purpose of this document is to standardize the package-local nicknames
extension and to address some existing issues (mostly <b>print-read</b>
consistency).
</p>

<p>
[TODO]
</p>

<p>
This CDR also aims to provide an extensive test suite for this extension.
</p>
</div>
</div>
</div>
<div id="outline-container-org804a50f" class="outline-2">
<h2 id="org804a50f"><span class="section-number-2">3</span> Specification</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6999964" class="outline-3">
<h3 id="org6999964"><span class="section-number-3">3.1</span> Description</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgbd0de20" class="outline-4">
<h4 id="orgbd0de20"><span class="section-number-4">3.1.1</span> Concept</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<i>Package-local nickname</i> (or <i>local nickname</i>) has the same effects as a
normal <i>package nickname</i> (later <i>global nickname</i>), except that these
effects only apply when <code>*package*</code> is bound to a package for which the
nickname has been defined.
</p>

<p>
That means that calls to <code>find-package</code> with a <i>local nickname</i> defined in
the <i>current package</i> should return the package nicknamed by this nickname.
</p>

<p>
This also affects all implied calls to <code>find-package</code>, including those
performed by the lisp reader.
</p>

<p>
In addition, to maintain <b>print-read</b> consistency, the lisp printer is
affected by <i>local nicknames</i> defined in the <i>current package</i>, for details
see <a href="#print-read-consistency">PRINT-READ consistency</a>.
</p>

<p>
<i>Local nickname</i> is allowed to shadow a <i>package name</i> or a <i>global
nickname</i>, except for the names <code>#:CL</code>, <code>#:COMMON-LISP</code> and <code>#:KEYWORD</code>
which should always refer to their packages.
</p>
</div>
</div>
