cdr-15.tex

sbcl, ccl, acl, abcl: they don't.

ecl: they do.

clasp: they do in some weird way - also depends on order in which PLN are
added.

\item It is not clear whether it is valid to have a \emph{local nickname} in a package
shadowing its own name or nickname.

Now: SBCL signals an error, but that doesn't make much sense, especially if
a \emph{local nickname} shadows the \emph{global nickname} of a package and not its
name. And it is possible to achieve a \emph{local nickname} shadowing a \emph{global
nickname} or the \emph{package name} by renaming the package.

\textbf{PROPOSAL}

It should be allowed, but a warning might be signaled.

\textbf{CURRENTLY}:

sbcl, ccl, abcl: not allowed.

ecl, acl, clasp: allowed.
\item \textbf{PROPOSAL}

Add \texttt{:local-nicknames} option to \texttt{make-package} similar to \texttt{defpackage}.
See \hyperref[sec:org650726f]{make-package}.

\textbf{CURRENTLY}:

ecl: takes keyword parameter, but segfaults on incorrect usage + doesn't
have it in docstring. :/

acl: has it

abcl, sbcl, ccl, clasp: don't have it.
\item It is not clear whether functions \texttt{package-local-nicknames} and
\texttt{package-locally-nicknamed-by-list} should be allowed to return
lists with duplicate entries.

\textbf{PROPOSAL}

They should not.

\textbf{CURRENTLY}:

sbcl, acl, clasp, ccl, abcl, ecl: don't return duplicate entries from \texttt{package-local-nicknames}.

sbcl, acl, clasp: don't return duplicate entries from \texttt{package-locally-nicknamed-by-list}.

ccl, abcl, ecl: return duplicate entries from \texttt{package-locally-nicknamed-by-list}.
\end{enumerate}
\section{Introduction}
\label{sec:orgec3f10d}
This is a specification for package-local nicknames extension in Common Lisp.
\subsection{Rationale}
\label{sec:org4ed340d}
Package-local nicknames allow to use short and easy-to-use names without
potentially introducing name conflict as with normal nicknames.
\subsection{Current state}
\label{sec:org224c132}
Package-local nicknames are implemented (at least partially) in \texttt{SBCL},
\texttt{CCL}, \texttt{ECL}, \texttt{Clasp}, \texttt{ABCL}, \texttt{Allegro CL}, \texttt{LispWorks}. Unfortunately,
there are multiple inconsistencies between implementations, and all
implementations lose \textbf{print-read} consistency to some extent.
\subsection{Goal}
\label{sec:org0c02d79}
The purpose of this document is to standardize the package-local nicknames
extension and to address some existing issues (mostly \textbf{print-read}
consistency).

[TODO]

This CDR also aims to provide an extensive test suite for this extension.
\section{Specification}
\label{sec:org51691c6}
\subsection{Description}
\label{sec:org8daf056}
\subsubsection{Concept}
\label{sec:orgc3c80a8}
\emph{Package-local nickname} (or \emph{local nickname}) has the same effects as a
normal \emph{package nickname} (later \emph{global nickname}), except that these
effects only apply when \texttt{*package*} is bound to a package for which the
nickname has been defined.

That means that calls to \texttt{find-package} with a \emph{local nickname} defined in
the \emph{current package} should return the package nicknamed by this nickname.

This also affects all implied calls to \texttt{find-package}, including those
performed by the lisp reader.

In addition, to maintain \textbf{print-read} consistency, the lisp printer is
affected by \emph{local nicknames} defined in the \emph{current package}, for details
see \hyperref[sec:org1748ec5]{PRINT-READ consistency}.

\emph{Local nickname} is allowed to shadow a \emph{package name} or a \emph{global
nickname}, except for the names \texttt{\#:CL}, \texttt{\#:COMMON-LISP} and \texttt{\#:KEYWORD}
which should always refer to their packages.
