cdr-15.org
**** defpackage
     :PROPERTIES:
     :CUSTOM_ID: defpackage
     :END:

     ~defpackage~ options are extended to include /local-nicknames-option/:
     : local-nicknames-option ::= (:local-nicknames (nickname package)*)

     Each pair specifies a /local nickname/ ~nickname~ for the corresponding
     ~package~.

     This option may appear more than once and is executed *after* all standard
     options.

     To avoid confusion, /local nicknames/ of the /current package/ must be
     ignored in ~defpackage~. In other words ~defpackage~ must *not* be affected
     by the ~*package*~ special variable.
***** Arguments and Values:
      ~nickname~ must be a /string designator/.

      ~package~ must be a /package designator/.
***** Exceptional situations
      An error of type ~package-error~ is signaled when a package designated by
      ~package~ does not exists.

      [OR DOES IT?]

      Name conflict errors are handled by the underlying calls to
      ~add-package-local-nickname~.

      See [[#exceptional-situations-2][add-package-local-nickname: exceptional situations]].
***** Implementation dependent
      The behaviour is unspecified when a package designated by ~package~ does
      not exists.

      [OR IT IS?]

      The behaviour is unspecified when a /local nickname/ is specified for the
      package that is being defined.

      The behaviour is unspecified when supplied /local nicknames/ are at
      variance with the current state of the package that is being defined. An
      implementation might choose to remove all present /local nicknames/ at the
      begining of each redefinition of the package.

      [TODO: What happens when a package is redefined with local
      nicknames in other packages that it is nicknamed by? It probably
      can't be strictly defined since redefining package is
      implementation dependent... But seems like they must be left
      intact.]
-----
**** make-package
     :PROPERTIES:
     :CUSTOM_ID: make-package
     :END:

     (*PROPOSAL* for new API.)

     To avoid confusion, /local nicknames/ of the /current package/ must be
     ignored during evaluation of ~make-package~. In other words ~make-package~
     must *not* be affected by the ~*package*~ special variable.

     ~make-package~ lambda list is extended to include an additional key
     parameter: ~local-nicknames~.
     : local-nicknames ::= ((nickname package)*)

     ~local-nicknames~ defaults to an /empty list/.

     ~local-nicknames~ must be a /list/ each element of which must be a /list/
     of form ~(nickname package)~. Specifies /local nicknames/ in the new
     /package/.
***** Arguments and Values:
      ~local-nicknames~ must be a /string designator/.

      ~nickname~ must be a /string designator/.

      ~package~ must be a /package designator/.
***** Exceptional situations
      An error of type ~package-error~ is signaled when a package designated by
      ~package~ does not exists.

      [OR DOES IT?]

      Name conflict errors are handled by the underlying calls to
      ~add-package-local-nickname~.

      See [[#exceptional-situations-2][add-package-local-nickname: exceptional situations]].
***** Implementation dependent
      The behaviour is unspecified when a package designated by ~package~ does
      not exists.

      [OR IT IS?]

      The behaviour is unspecified when a /local nickname/ is specified for the
      package that is being defined.
***** Notes
      It is still possible to specify a package designated by /local nickname/
      in ~:use~ and/or ~:local-nicknames~ parameters by calling ~find-package~
      before calling ~make-package~.
-----
**** add-package-local-nickname
     : (add-package-local-nickname nickname actual-package &optional designated-package)
     :   => designated-package-object
     ~designated-package~ defaults to the /current package/.

     Adds a /package-local nickname/ ~nickname~ for the ~actual-package~ in the
     ~designated-package~.

     Returns the package designated by ~designated-package~.

     If a /nickname/ is already defined, checks that it is defined for the
     package designated by ~actual-package~.
***** Arguments and Values
      ~nickname~ must be a /string designator/.

      ~actual-package~ and ~designated-package~ must be /package designators/.

      ~designated-package-object~ is of type /package/.
