cdr-15.html
<div id="outline-container-org603cdeb" class="outline-4">
<h4 id="org603cdeb"><span class="section-number-4">3.1.2</span> API</h4>
<div class="outline-text-4" id="text-3-1-2">
<hr />
</div>
<ol class="org-ol">
<li><a id="defpackage"></a>defpackage<br />
<div class="outline-text-5" id="text-defpackage">
<p>
<code>defpackage</code> options are extended to include <i>local-nicknames-option</i>:
</p>
<pre class="example">
local-nicknames-option ::= (:local-nicknames (nickname package)*)
</pre>


<p>
Each pair specifies a <i>local nickname</i> <code>nickname</code> for the corresponding
<code>package</code>.
</p>

<p>
This option may appear more than once.
</p>
</div>
<ol class="org-ol">
<li><a id="org2205b78"></a>Arguments and Values:<br />
<div class="outline-text-6" id="text-3-1-2-1-1">
<p>
<code>nickname</code> must be a <i>string designator</i>.
</p>

<p>
<code>package</code> must be a <i>package designator</i>.
</p>
</div>
</li>
<li><a id="org12db968"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-3-1-2-1-2">
<p>
An error of type <code>package-error</code> is signaled when a package designated by
<code>package</code> does not exists.
</p>

<p>
Name conflict errors are handled by the underlying calls to
<code>add-package-local-nickname</code>.
</p>

<p>
See <a href="#exceptional-situations-2">add-package-local-nickname: exceptional situations</a>.
</p>
</div>
</li>
<li><a id="org8fc1800"></a>Implementation dependent<br />
<div class="outline-text-6" id="text-3-1-2-1-3">
<p>
The behaviour is unspecified when a <i>local nickname</i> is specified for the
package that is being defined.
</p>

<p>
The behaviour is unspecified when supplied <i>local nicknames</i> are at
variance with the current state of the package that is being defined. An
implementation might choose to remove all present <i>local nicknames</i> at the
begining of each redefinition of the package.
</p>

<p>
[TODO: What happens when a package is redefined with local
nicknames in other packages that it is nicknamed by? It probably
can't be strictly defined since redefining package is
implementation dependent&#x2026; But seems like they must be left
intact.]
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="make-package"></a>make-package<br />
<div class="outline-text-5" id="text-make-package">
<p>
<a href="#proposal-6">Proposal#6</a>
</p>

<p>
<code>make-package</code> lambda list is extended to include an additional key
parameter: <code>local-nicknames</code>.
</p>
<pre class="example">
local-nicknames ::= ((nickname package)*)
</pre>


<p>
<code>local-nicknames</code> defaults to an <i>empty list</i>.
</p>

<p>
<code>local-nicknames</code> must be a <i>list</i> each element of which must be a <i>list</i>
of form <code>(nickname package)</code>. Specifies <i>local nicknames</i> in the new
<i>package</i>.
</p>
</div>
<ol class="org-ol">
<li><a id="org40c1d8d"></a>Arguments and Values:<br />
<div class="outline-text-6" id="text-3-1-2-2-1">
<p>
<code>local-nicknames</code> must be a a <i>list</i> of pairs <code>(nickname package)</code>.
</p>

<p>
<code>nickname</code> must be a <i>string designator</i>.
</p>

<p>
<code>package</code> must be a <i>package designator</i>.
</p>
</div>
</li>
<li><a id="org9e795d1"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-3-1-2-2-2">
<p>
An error of type <code>package-error</code> is signaled when a package designated by
<code>package</code> does not exists.
</p>

<p>
Name conflict errors are handled by the underlying calls to
<code>add-package-local-nickname</code>.
</p>

<p>
See <a href="#exceptional-situations-2">add-package-local-nickname: exceptional situations</a>.
</p>
</div>
</li>
<li><a id="orgc8f571a"></a>Implementation dependent<br />
<div class="outline-text-6" id="text-3-1-2-2-3">
<p>
The behaviour is unspecified when a <i>local nickname</i> is specified for the
package that is being defined.
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="org4f89c7a"></a>add-package-local-nickname<br />
<div class="outline-text-5" id="text-3-1-2-3">
<pre class="example">
(add-package-local-nickname nickname actual-package &amp;optional designated-package)
  =&gt; designated-package-object
</pre>

<p>
<code>designated-package</code> defaults to the <i>current package</i>.
</p>

<p>
Adds a <i>package-local nickname</i> <code>nickname</code> for the <code>actual-package</code> in the
<code>designated-package</code>.
</p>

<p>
Returns the package designated by <code>designated-package</code>.
</p>

<p>
If a <i>nickname</i> is already defined, checks that it is defined for the
package designated by <code>actual-package</code>.
</p>
</div>
<ol class="org-ol">
<li><a id="orga35f68e"></a>Arguments and Values<br />
<div class="outline-text-6" id="text-3-1-2-3-1">
<p>
<code>nickname</code> must be a <i>string designator</i>.
</p>

<p>
<code>actual-package</code> and <code>designated-package</code> must be <i>package designators</i>.
</p>

<p>
<code>designated-package-object</code> is of type <i>package</i>.
</p>
</div>
</li>
