cdr-15.tex
\subsubsection{API}
\label{sec:orgf70bc2a}
\noindent\rule{\textwidth}{0.5pt}
\begin{enumerate}
\item defpackage
\label{sec:org40b069b}
\texttt{defpackage} options are extended to include \emph{local-nicknames-option}:
\begin{verbatim}
local-nicknames-option ::= (:local-nicknames (nickname package)*)
\end{verbatim}


Each pair specifies a \emph{local nickname} \texttt{nickname} for the corresponding
\texttt{package}.

This option may appear more than once and is executed \textbf{after} all standard
options.

To avoid confusion, \emph{local nicknames} of the \emph{current package} must be
ignored in \texttt{defpackage}. In other words \texttt{defpackage} must \textbf{not} be affected
by the \texttt{*package*} special variable.
\begin{enumerate}
\item Arguments and Values:
\label{sec:orgd4f4c79}
\texttt{nickname} must be a \emph{string designator}.

\texttt{package} must be a \emph{package designator}.
\item Exceptional situations
\label{sec:org6a2d372}
An error of type \texttt{package-error} is signaled when a package designated by
\texttt{package} does not exists.

[OR DOES IT?]

Name conflict errors are handled by the underlying calls to
\texttt{add-package-local-nickname}.

See \hyperref[sec:orgaf439b6]{add-package-local-nickname: exceptional situations}.
\item Implementation dependent
\label{sec:org4240ac9}
The behaviour is unspecified when a package designated by \texttt{package} does
not exists.

[OR IT IS?]

The behaviour is unspecified when a \emph{local nickname} is specified for the
package that is being defined.

The behaviour is unspecified when supplied \emph{local nicknames} are at
variance with the current state of the package that is being defined. An
implementation might choose to remove all present \emph{local nicknames} at the
begining of each redefinition of the package.

[TODO: What happens when a package is redefined with local
nicknames in other packages that it is nicknamed by? It probably
can't be strictly defined since redefining package is
implementation dependent\ldots{} But seems like they must be left
intact.]

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item make-package
\label{sec:org650726f}
(\textbf{PROPOSAL} for new API.)

To avoid confusion, \emph{local nicknames} of the \emph{current package} must be
ignored during evaluation of \texttt{make-package}. In other words \texttt{make-package}
must \textbf{not} be affected by the \texttt{*package*} special variable.

\texttt{make-package} lambda list is extended to include an additional key
parameter: \texttt{local-nicknames}.
\begin{verbatim}
local-nicknames ::= ((nickname package)*)
\end{verbatim}


\texttt{local-nicknames} defaults to an \emph{empty list}.

\texttt{local-nicknames} must be a \emph{list} each element of which must be a \emph{list}
of form \texttt{(nickname package)}. Specifies \emph{local nicknames} in the new
\emph{package}.
\begin{enumerate}
\item Arguments and Values:
\label{sec:orgcb794ca}
\texttt{local-nicknames} must be a \emph{string designator}.

\texttt{nickname} must be a \emph{string designator}.

\texttt{package} must be a \emph{package designator}.
\item Exceptional situations
\label{sec:org3993857}
An error of type \texttt{package-error} is signaled when a package designated by
\texttt{package} does not exists.

[OR DOES IT?]

Name conflict errors are handled by the underlying calls to
\texttt{add-package-local-nickname}.

See \hyperref[sec:orgaf439b6]{add-package-local-nickname: exceptional situations}.
\item Implementation dependent
\label{sec:org7d1e70e}
The behaviour is unspecified when a package designated by \texttt{package} does
not exists.

[OR IT IS?]

The behaviour is unspecified when a \emph{local nickname} is specified for the
package that is being defined.
\item Notes
\label{sec:orge58c357}
It is still possible to specify a package designated by \emph{local nickname}
in \texttt{:use} and/or \texttt{:local-nicknames} parameters by calling \texttt{find-package}
before calling \texttt{make-package}.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item add-package-local-nickname
\label{sec:org3cd3787}
\begin{verbatim}
(add-package-local-nickname nickname actual-package &optional designated-package)
  => designated-package-object
\end{verbatim}

\texttt{designated-package} defaults to the \emph{current package}.

Adds a \emph{package-local nickname} \texttt{nickname} for the \texttt{actual-package} in the
\texttt{designated-package}.

Returns the package designated by \texttt{designated-package}.

If a \emph{nickname} is already defined, checks that it is defined for the
package designated by \texttt{actual-package}.
\begin{enumerate}
\item Arguments and Values
\label{sec:org202d2c5}
\texttt{nickname} must be a \emph{string designator}.

\texttt{actual-package} and \texttt{designated-package} must be \emph{package designators}.

\texttt{designated-package-object} is of type \emph{package}.
\item Exceptional situations
\label{sec:orgaf439b6}
If a package designated by \texttt{actual-package} or a package designated by
\texttt{designated-package} does not exists, an error of type \emph{package-error}
must be signaled.
