cdr-15.org
***** Exceptional situations
      :PROPERTIES:
      :CUSTOM_ID: exceptional-situations-2
      :END:

      If a package designated by ~actual-package~ or a package designated by
      ~designated-package~ does not exists, an error of type /package-error/
      must be signaled.

      If ~nickname~ is one of the names ~#:CL~, ~#:COMMON-LISP~ or ~#:KEYWORD~,
      an error of type /package-error/ must be signaled.

      If ~nickname~ is a /local nickname/ for a package different from
      ~actual-package~, an error of type /package-error/ must be signaled.
***** Implementation dependent
      *PROPOSAL* (See [[#issues][issues#4]].)

      If ~nickname~ shadows the ~designated-package~'s /package name/ or one of
      its /global nicknames/, a style warning might signaled.
-----
**** remove-package-local-nickname
     : (remove-package-local-nickname old-nickname &optional designated-package)
     :   => nickname-removed-p
     ~designated-package~ defaults to the /current package/.

     If ~designated-package~ has ~old-nickname~ as a /local nickname/, it is
     removed.

     Returns /true/ if the ~old-nickname~ existed (and was removed), and ~NIL~
     otherwise.
***** Arguments and Values
      ~old-nickname~ must be a /string designator/.

      ~designated-package~ must be a /package designator/.

      ~nickname-removed-p~ is a /generalized boolean/.
***** Exceptional situations
      If a package designated by ~designated-package~ does not exists, an error of
      type /package-error/ must be signaled.
-----
**** package-local-nicknames
     : (package-local-nicknames package)
     :   => local-nicknames-alist
     Returns an /alist/ describing local nicknames defined in a package
     designated by ~package~.

     Each cons cell in ~local-nicknames-alist~ is of the form ~(nickname . package)~
     where ~nickname~ is of type /string/ and ~package~ is of type
     /package/.
***** Arguments and Values
      ~package~ must be a /package designator/.

      ~local-nicknames-alist~ is an /alist/ with keys of type /string/ and
      values of type /package/.
***** Exceptional situations
      An error of type ~package-error~ is signaled when a package designated by
      ~package~ does not exists.
***** Notes
      The returned /alist/ must be safe to be modified by the user.
-----
**** package-locally-nicknamed-by-list
     : (package-locally-nicknamed-by-list package)
     :   => packages-list
     Returns a /list/ of packages that have a /local nickname/ defined for the
     package designated by ~package~.
***** Arguments and Values
      ~package~ must be a /package designator/.

      ~packages-list~ is a /list/ with elements of type /package/.
***** Exceptional situations
      An error of type ~package-error~ is signaled when a package designated by
      ~package~ does not exists.
***** Notes
      The returned /list/ must be safe to be modified by the user.
-----
*** Affected symbols
-----
**** defpackage
     See [[#defpackage][defpackage]].
-----
**** make-package
     See [[#make-package][make-package]].
-----
**** find-package
     When argument to ~find-package~ is a /local nickname/ that is defined in
     the /current package/, returns the package corresponding to this nickname.

     This also affects all implied calls to ~find-package~, including but not
     limited to those performed by the lisp reader as well as those performed by
     ~export~, ~find-symbol~, ~import~, ~rename-package~, ~shadow~,
     ~shadowing-import~, ~delete-package~, ~with-package-iterator~, ~unexport~,
     ~unintern~, ~in-package~, ~unuse-package~, ~use-package~, ~do-symbols~,
     ~do-external-symbols~, ~do-all-symbols~, ~intern~, ~package-name~,
     ~package-nicknames~, ~package-shadowing-symbols~, ~package-use-list~,
     ~package-used-by-list~.

     ~add-package-local-nickname~, ~remove-package-local-nickname~,
     ~package-local-nicknames~ and ~package-locally-nicknamed-by~ are also
     affected.

     There are two exceptions: ~make-package~ and ~defpackage~ must *not* be
     affected by /local nicknames/ of the /current package/.
-----
