cdr-15.html
<li><a id="exceptional-situations-2"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-exceptional-situations-2">
<p>
If a package designated by <code>actual-package</code> or a package designated by
<code>designated-package</code> does not exists, an error of type <i>package-error</i>
must be signaled.
</p>

<p>
If <code>nickname</code> is one of the names <code>#:CL</code>, <code>#:COMMON-LISP</code> or <code>#:KEYWORD</code>,
an error of type <i>package-error</i> must be signaled.
</p>

<p>
If <code>nickname</code> is a <i>local nickname</i> for a package different from
<code>actual-package</code>, an error of type <i>package-error</i> must be signaled.
</p>
</div>
</li>
<li><a id="org075e0d0"></a>Implementation dependent<br />
<div class="outline-text-6" id="text-3-1-2-3-3">
<p>
<b>PROPOSAL</b> (See <a href="#issues">issues#4</a>.)
</p>

<p>
If <code>nickname</code> shadows the <code>designated-package</code>'s <i>package name</i> or one of
its <i>global nicknames</i>, a style warning might signaled.
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="orge1d953f"></a>remove-package-local-nickname<br />
<div class="outline-text-5" id="text-3-1-2-4">
<pre class="example">
(remove-package-local-nickname old-nickname &amp;optional designated-package)
  =&gt; nickname-removed-p
</pre>

<p>
<code>designated-package</code> defaults to the <i>current package</i>.
</p>

<p>
If <code>designated-package</code> has <code>old-nickname</code> as a <i>local nickname</i>, it is
removed.
</p>

<p>
Returns <i>true</i> if the <code>old-nickname</code> existed (and was removed), and <code>NIL</code>
otherwise.
</p>
</div>
<ol class="org-ol">
<li><a id="orgaa9bca6"></a>Arguments and Values<br />
<div class="outline-text-6" id="text-3-1-2-4-1">
<p>
<code>old-nickname</code> must be a <i>string designator</i>.
</p>

<p>
<code>designated-package</code> must be a <i>package designator</i>.
</p>

<p>
<code>nickname-removed-p</code> is a <i>generalized boolean</i>.
</p>
</div>
</li>
<li><a id="orgcb81b51"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-3-1-2-4-2">
<p>
If a package designated by <code>designated-package</code> does not exists, an error of
type <i>package-error</i> must be signaled.
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="org108fda1"></a>package-local-nicknames<br />
<div class="outline-text-5" id="text-3-1-2-5">
<pre class="example">
(package-local-nicknames package)
  =&gt; local-nicknames-alist
</pre>

<p>
Returns an <i>alist</i> describing local nicknames defined in a package
designated by <code>package</code>.
</p>

<p>
Each cons cell in <code>local-nicknames-alist</code> is of the form <code>(nickname . package)</code>
where <code>nickname</code> is of type <i>string</i> and <code>package</code> is of type
<i>package</i>.
</p>
</div>
<ol class="org-ol">
<li><a id="org6d1fa1a"></a>Arguments and Values<br />
<div class="outline-text-6" id="text-3-1-2-5-1">
<p>
<code>package</code> must be a <i>package designator</i>.
</p>

<p>
<code>local-nicknames-alist</code> is an <i>alist</i> with keys of type <i>string</i> and
values of type <i>package</i>.
</p>
</div>
</li>
<li><a id="org9ca5691"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-3-1-2-5-2">
<p>
An error of type <code>package-error</code> is signaled when a package designated by
<code>package</code> does not exists.
</p>
</div>
</li>
<li><a id="orgf3ffb0a"></a>Notes<br />
<div class="outline-text-6" id="text-3-1-2-5-3">
<p>
The returned <i>alist</i> must be safe to be modified by the user.
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="org7a40bbb"></a>package-locally-nicknamed-by-list<br />
<div class="outline-text-5" id="text-3-1-2-6">
<pre class="example">
(package-locally-nicknamed-by-list package)
  =&gt; packages-list
</pre>

<p>
Returns a <i>list</i> of packages that have a <i>local nickname</i> defined for the
package designated by <code>package</code>.
</p>
</div>
<ol class="org-ol">
<li><a id="orgc5e3803"></a>Arguments and Values<br />
<div class="outline-text-6" id="text-3-1-2-6-1">
<p>
<code>package</code> must be a <i>package designator</i>.
</p>

<p>
<code>packages-list</code> is a <i>list</i> with elements of type <i>package</i>.
</p>
</div>
</li>
<li><a id="orgbe27034"></a>Exceptional situations<br />
<div class="outline-text-6" id="text-3-1-2-6-2">
<p>
An error of type <code>package-error</code> is signaled when a package designated by
<code>package</code> does not exists.
</p>
</div>
</li>
<li><a id="org2d87302"></a>Notes<br />
<div class="outline-text-6" id="text-3-1-2-6-3">
<p>
The returned <i>list</i> must be safe to be modified by the user.
</p>
<hr />
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgea54de3" class="outline-4">
<h4 id="orgea54de3"><span class="section-number-4">3.1.3</span> Affected symbols</h4>
<div class="outline-text-4" id="text-3-1-3">
<hr />
</div>
<ol class="org-ol">
<li><a id="orgc54d196"></a>defpackage<br />
<div class="outline-text-5" id="text-3-1-3-1">
<p>
See <a href="#defpackage">defpackage</a>.
</p>
<hr />
</div>
</li>
<li><a id="org3295598"></a>make-package<br />
<div class="outline-text-5" id="text-3-1-3-2">
<p>
See <a href="#make-package">make-package</a>.
</p>
<hr />
</div>
</li>
<li><a id="org8eac6cf"></a>find-package<br />
<div class="outline-text-5" id="text-3-1-3-3">
<p>
When argument to <code>find-package</code> is a <i>local nickname</i> that is defined in
the <i>current package</i>, returns the package corresponding to this nickname.
</p>

<p>
This also affects all implied calls to <code>find-package</code>, including but not
limited to those performed by the lisp reader as well as those performed by
<code>export</code>, <code>find-symbol</code>, <code>import</code>, <code>rename-package</code>, <code>shadow</code>,
<code>shadowing-import</code>, <code>delete-package</code>, <code>with-package-iterator</code>, <code>unexport</code>,
<code>unintern</code>, <code>in-package</code>, <code>unuse-package</code>, <code>use-package</code>, <code>do-symbols</code>,
<code>do-external-symbols</code>, <code>do-all-symbols</code>, <code>intern</code>, <code>package-name</code>,
<code>package-nicknames</code>, <code>package-shadowing-symbols</code>, <code>package-use-list</code>,
<code>package-used-by-list</code>.
</p>

<p>
<code>add-package-local-nickname</code>, <code>remove-package-local-nickname</code>,
<code>package-local-nicknames</code> and <code>package-locally-nicknamed-by</code> are also
affected.
</p>

<p>
There are two exceptions: <code>make-package</code> and <code>defpackage</code> must <b>not</b> be
affected by <i>local nicknames</i> of the <i>current package</i>.
</p>
<hr />
</div>
</li>
