cdr-15.tex

If \texttt{nickname} is one of the names \texttt{\#:CL}, \texttt{\#:COMMON-LISP} or \texttt{\#:KEYWORD},
an error of type \emph{package-error} must be signaled.

If \texttt{nickname} is a \emph{local nickname} for a package different from
\texttt{actual-package}, an error of type \emph{package-error} must be signaled.
\item Implementation dependent
\label{sec:orgdc23e86}
\textbf{PROPOSAL} (See \hyperref[sec:orgeeb4508]{issues\#4}.)

If \texttt{nickname} shadows the \texttt{designated-package}'s \emph{package name} or one of
its \emph{global nicknames}, a style warning might signaled.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item remove-package-local-nickname
\label{sec:org7b7163f}
\begin{verbatim}
(remove-package-local-nickname old-nickname &optional designated-package)
  => nickname-removed-p
\end{verbatim}

\texttt{designated-package} defaults to the \emph{current package}.

If \texttt{designated-package} has \texttt{old-nickname} as a \emph{local nickname}, it is
removed.

Returns \emph{true} if the \texttt{old-nickname} existed (and was removed), and \texttt{NIL}
otherwise.
\begin{enumerate}
\item Arguments and Values
\label{sec:orgfcbc7d0}
\texttt{old-nickname} must be a \emph{string designator}.

\texttt{designated-package} must be a \emph{package designator}.

\texttt{nickname-removed-p} is a \emph{generalized boolean}.
\item Exceptional situations
\label{sec:org1f5b161}
If a package designated by \texttt{designated-package} does not exists, an error of
type \emph{package-error} must be signaled.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item package-local-nicknames
\label{sec:orgd4111f7}
\begin{verbatim}
(package-local-nicknames package)
  => local-nicknames-alist
\end{verbatim}

Returns an \emph{alist} describing local nicknames defined in a package
designated by \texttt{package}.

Each cons cell in \texttt{local-nicknames-alist} is of the form \texttt{(nickname . package)}
where \texttt{nickname} is of type \emph{string} and \texttt{package} is of type
\emph{package}.
\begin{enumerate}
\item Arguments and Values
\label{sec:org1741fa6}
\texttt{package} must be a \emph{package designator}.

\texttt{local-nicknames-alist} is an \emph{alist} with keys of type \emph{string} and
values of type \emph{package}.
\item Exceptional situations
\label{sec:org4a23ef6}
An error of type \texttt{package-error} is signaled when a package designated by
\texttt{package} does not exists.
\item Notes
\label{sec:org19874ce}
The returned \emph{alist} must be safe to be modified by the user.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item package-locally-nicknamed-by-list
\label{sec:org7624d36}
\begin{verbatim}
(package-locally-nicknamed-by-list package)
  => packages-list
\end{verbatim}

Returns a \emph{list} of packages that have a \emph{local nickname} defined for the
package designated by \texttt{package}.
\begin{enumerate}
\item Arguments and Values
\label{sec:org132495a}
\texttt{package} must be a \emph{package designator}.

\texttt{packages-list} is a \emph{list} with elements of type \emph{package}.
\item Exceptional situations
\label{sec:orgf91029e}
An error of type \texttt{package-error} is signaled when a package designated by
\texttt{package} does not exists.
\item Notes
\label{sec:org70ac11b}
The returned \emph{list} must be safe to be modified by the user.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\end{enumerate}
\subsubsection{Affected symbols}
\label{sec:orge8d5746}
\noindent\rule{\textwidth}{0.5pt}
\begin{enumerate}
\item defpackage
\label{sec:org0343934}
See \hyperref[sec:org40b069b]{defpackage}.

\noindent\rule{\textwidth}{0.5pt}
\item make-package
\label{sec:org4d89652}
See \hyperref[sec:org650726f]{make-package}.

\noindent\rule{\textwidth}{0.5pt}
\item find-package
\label{sec:orgdfb0eed}
When argument to \texttt{find-package} is a \emph{local nickname} that is defined in
the \emph{current package}, returns the package corresponding to this nickname.

This also affects all implied calls to \texttt{find-package}, including but not
limited to those performed by the lisp reader as well as those performed by
\texttt{export}, \texttt{find-symbol}, \texttt{import}, \texttt{rename-package}, \texttt{shadow},
\texttt{shadowing-import}, \texttt{delete-package}, \texttt{with-package-iterator}, \texttt{unexport},
\texttt{unintern}, \texttt{in-package}, \texttt{unuse-package}, \texttt{use-package}, \texttt{do-symbols},
\texttt{do-external-symbols}, \texttt{do-all-symbols}, \texttt{intern}, \texttt{package-name},
\texttt{package-nicknames}, \texttt{package-shadowing-symbols}, \texttt{package-use-list},
\texttt{package-used-by-list}.

\texttt{add-package-local-nickname}, \texttt{remove-package-local-nickname},
\texttt{package-local-nicknames} and \texttt{package-locally-nicknamed-by} are also
affected.

There are two exceptions: \texttt{make-package} and \texttt{defpackage} must \textbf{not} be
affected by \emph{local nicknames} of the \emph{current package}.

\noindent\rule{\textwidth}{0.5pt}
\item rename-package
\label{sec:org0818399}
