cdr-15.html
<li><a id="orge0deda3"></a>rename-package<br />
<div class="outline-text-5" id="text-3-1-3-4">
<p>
When a package is renamed via <code>rename-package</code> it maintains all <i>local
nicknames</i> it is nicknamed by, as well as all <i>local nicknames</i> it has
defined.
</p>
</div>
<ol class="org-ol">
<li><a id="org00f089f"></a>Implementation dependent<br />
<div class="outline-text-6" id="text-3-1-3-4-1">
<p>
<b>PROPOSAL</b> (See <a href="#issues">issues#4</a>.)
</p>

<p>
If a <i>new-name</i> or one of <i>new-nicknames</i> is shadowed by one of the <i>local
nicknames</i> of the package being redefined, a warning might be signaled.
</p>
<hr />
</div>
</li>
</ol>
</li>
<li><a id="org572e172"></a>delete-package<br />
<div class="outline-text-5" id="text-3-1-3-5">
<p>
When a package is deleted via <code>delete-package</code> all <i>local nicknames</i>
defined in other packages that it was nicknamed by must be removed as well
as all <i>local nicknames</i> defined in the package that is being deleted.
</p>

<p>
This also means that this package must not be available by calls to
<code>package-locally-nicknamed-by-list</code> and <code>package-local-nicknames</code>.
</p>
<hr />
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb6128c8" class="outline-4">
<h4 id="orgb6128c8"><span class="section-number-4">3.1.4</span> Edge cases</h4>
<div class="outline-text-4" id="text-3-1-4">
</div>
<ol class="org-ol">
<li><a id="print-read-consistency"></a>PRINT-READ consistency<br />
<div class="outline-text-5" id="text-print-read-consistency">
<p>
Lisp reader uses <code>find-package</code> to read a symbol, and is affected by <i>local
nicknames</i> of the <i>current package</i>. So in order to maintain <b>print-read</b>
consistency it is required to use a correct <i>package prefix</i> - such prefix
that calling <code>find-package</code> on it in the <i>current package</i> will return the
symbol's <i>home package</i>.
</p>

<p>
There are several situations to consider:
</p>
<ol class="org-ol">
<li><p>
There <b>is</b> a <i>local nickname</i> defined in the <i>current package</i> for the
symbol's <i>home package</i>.
</p>

<p>
<i>In this case such local nickname can be used as the package prefix.</i>
</p></li>
<li><p>
Symbol's home <i>package name</i> or one of its <i>global nicknames</i> is not
shadowed by any <i>local nickname</i> defined in the <i>current package</i>.
</p>

<p>
<i>In this case that package name or global nickname can be used as the
package prefix.</i>
</p></li>
<li><p>
Symbol's home <i>package name</i> and all its <i>global nicknames</i> are shadowed
by one of the <i>local nicknames</i> of the <i>current package</i> and there <b>is
no</b> <i>local nickname</i> defined (in the <i>current package</i>) for the symbol's
home package.
</p>

<p>
<b>PROPOSALS</b>
</p>
<ul class="org-ul">
<li><p>
The symbol must be printed using the <code>#.</code> syntax:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:find-symbol "BAR" "FOO"))
;; or
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:intern "BAR" "FOO"))
</pre>
</div>
<p>
Note that <code>#:KEYWORD</code> name is reserved for the <code>#:KEYWORD</code> package and
cannot be used as a <i>local nickname</i> thus this expression will always
evaluate to the symbol <code>foo::bar</code>.
</p></li>
<li><p>
<i>Shinmera's idea</i>. In this case an extended <code>#:</code> syntax should be used:
</p>
<pre class="example">
#:(package name) and #::(package name)
</pre></li>
<li><p>
In this case the symbol must be printed using the <code>#`</code> syntax for
reading an expression ignoring <i>local nicknames</i> in the <i>current
package</i>:
</p>
<pre class="example">
#`foo:bar  and  #`foo::bar
</pre>


<p>
It can be implemented roughly as follows:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">(defun |#`-reader| (stream subchar arg)
  (declare (ignore subchar arg))
  (let* ((current-package *package*)
         (local-nicknames (package-local-nicknames current-package)))
    (loop for (nick . package) in local-nicknames
          do (remove-package-local-nickname nick current-package))
    (unwind-protect
         (read stream t nil t)
      (loop for (nick . package) in local-nicknames
            do (add-package-local-nickname nick package current-package)))))

(set-dispatch-macro-character #\# #\` #'|#`-reader|)
</pre>
</div>
<p>
It is implementation dependent whether <i>local nicknames</i> are actually
removed from the <i>current package</i> or not.
</p></li>
<li><p>
In this case the symbol must be printed unreadably (specifics are
implementation dependent):
</p>
<pre class="example">
#&lt;SYMBOL IN THE SHADOWED PACKAGE FOO:BAR&gt;
#&lt;SYMBOL IN THE SHADOWED PACKAGE FOO::BAR&gt;
</pre>

<p>
If <code>*print-readably*</code> is <i>true</i> must signal an error of type
<code>print-not-readable</code> without printing anything.
</p></li>
<li><p>
In this case the symbol must be printed using <code>:::</code> and <code>::::</code> syntax
to lookup and intern ignoring <i>local nicknames</i> respectively:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">foo:::bar  ; same as (cl:find-symbol "BAR" "FOO") in the #:KEYWORD package
foo::::bar  ; same as (cl:intern "BAR" "FOO") in #:KEYWORD package
</pre>
</div></li>
</ul></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb30f773" class="outline-4">
<h4 id="orgb30f773"><span class="section-number-4">3.1.5</span> <code>*FEATURES*</code></h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
If an implementation supports package-local nicknames it should add symbols
<code>:package-local-nicknames</code> and <code>:cdr-15</code> (per CDR 14) to <code>*features*</code>.
</p>
</div>
</div>
</div>
