cdr-15.tex
When a package is renamed via \texttt{rename-package} it maintains all \emph{local
nicknames} it is nicknamed by, as well as all \emph{local nicknames} it has
defined.
\begin{enumerate}
\item Implementation dependent
\label{sec:org45f7513}
\textbf{PROPOSAL} (See \hyperref[sec:orgeeb4508]{issues\#4}.)

If a \emph{new-name} or one of \emph{new-nicknames} is shadowed by one of the \emph{local
nicknames} of the package being redefined, a warning might be signaled.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\item delete-package
\label{sec:orgea7d711}
When a package is deleted via \texttt{delete-package} all \emph{local nicknames}
defined in other packages that it was nicknamed by must be removed as well
as all \emph{local nicknames} defined in the package that is being deleted.

This also means that this package must not be available by calls to
\texttt{package-locally-nicknamed-by-list} and \texttt{package-local-nicknames}.

\noindent\rule{\textwidth}{0.5pt}
\end{enumerate}
\subsubsection{Edge cases}
\label{sec:orgd3d361c}
\begin{enumerate}
\item PRINT-READ consistency
\label{sec:org1748ec5}
Lisp reader uses \texttt{find-package} to read a symbol, and is affected by \emph{local
nicknames} of the \emph{current package}. So in order to maintain \textbf{print-read}
consistency it is required to use a correct \emph{package prefix} - such prefix
that calling \texttt{find-package} on it in the \emph{current package} will return the
symbol's \emph{home package}.

There are several situations to consider:
\begin{enumerate}
\item There \textbf{is} a \emph{local nickname} defined in the \emph{current package} for the
symbol's \emph{home package}.

\emph{In this case such local nickname can be used as the package prefix.}
\item Symbol's home \emph{package name} or one of its \emph{global nicknames} is not
shadowed by any \emph{local nickname} defined in the \emph{current package}.

\emph{In this case that package name or global nickname can be used as the
package prefix.}
\item Symbol's home \emph{package name} and all its \emph{global nicknames} are shadowed
by one of the \emph{local nicknames} of the \emph{current package} and there \textbf{is
no} \emph{local nickname} defined (in the \emph{current package}) for the symbol's
home package.

\textbf{PROPOSALS}
\begin{itemize}
\item The symbol must be printed using the \texttt{\#.} syntax:
\begin{verbatim}
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:find-symbol "BAR" "FOO"))
;; or
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:intern "BAR" "FOO"))
\end{verbatim}
Note that \texttt{\#:KEYWORD} name is reserved for the \texttt{\#:KEYWORD} package and
cannot be used as a \emph{local nickname} thus this expression will always
evaluate to the symbol \texttt{foo::bar}.
\item In this case the symbol must be printed using \texttt{:::} and \texttt{::::} syntax
to lookup and intern ignoring \emph{local nicknames} respectively:
\begin{verbatim}
foo:::bar  ; same as (cl:find-symbol "BAR" "FOO") in the #:KEYWORD package
foo::::bar  ; same as (cl:intern "BAR" "FOO") in #:KEYWORD package
\end{verbatim}
\item In this case the symbol must be printed using the \texttt{\#`} syntax for
reading an expression ignoring \emph{local nicknames} in the \emph{current
package}:
\begin{verbatim}
#`foo:bar  and  #`foo::bar
\end{verbatim}


It can be implemented roughly as follows:
\begin{verbatim}
(defun |#`-reader| (stream subchar arg)
  (declare (ignore subchar arg))
  (let* ((current-package *package*)
         (local-nicknames (package-local-nicknames current-package)))
    (loop for (nick . package) in local-nicknames
          do (remove-package-local-nickname nick current-package))
    (unwind-protect
         (read stream t nil t)
      (loop for (nick . package) in local-nicknames
            do (add-package-local-nickname nick package current-package)))))

(set-dispatch-macro-character #\# #\` #'|#`-reader|)
\end{verbatim}
It is implementation dependent whether \emph{local nicknames} are actually
removed from the \emph{current package} or not.
\item In this case the symbol must be printed unreadably (specifics are
implementation dependent):
\begin{verbatim}
#<SYMBOL IN THE SHADOWED PACKAGE FOO:BAR>
#<SYMBOL IN THE SHADOWED PACKAGE FOO::BAR>
\end{verbatim}

If \texttt{*print-readably*} is \emph{true} must signal an error of type
\texttt{print-not-readable} without printing anything.
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{\texttt{*FEATURES*}}
\label{sec:org693d4a4}
If an implementation supports package-local nicknames it should add symbols
\texttt{:package-local-nicknames} and \texttt{:cdr-15} (per CDR 14) to \texttt{*features*}.
