cdr-15.org
* Links
  3b's [[https://github.com/3b/package-local-nicknames/blob/master/docs.org][notes]] on package-local nicknames.

  phoe's [[https://github.com/phoe/trivial-package-local-nicknames][tests]].

  SBCL's [[https://www.sbcl.org/manual/#Package_002dLocal-Nicknames][manual entry]].
* Copying and License
  [TODO]
