cdr-15.tex
\subsection{Examples}
\label{sec:org0410b23}
[TODO]
\section{Links}
\label{sec:org621fe64}
3b's \href{https://github.com/3b/package-local-nicknames/blob/master/docs.org}{notes} on package-local nicknames.

phoe's \href{https://github.com/phoe/trivial-package-local-nicknames}{tests}.

SBCL's \href{https://www.sbcl.org/manual/\#Package\_002dLocal-Nicknames}{manual entry}.
\section{Copying and License}
\label{sec:orge141632}
[TODO]
\end{document}
